---
kind: type
id: T:Autodesk.Revit.UI.EditorInteraction
source: html/30334b20-a279-d24f-dc43-f4b96184251d.htm
---
# Autodesk.Revit.UI.EditorInteraction

Wraps the EditorInteractionType for the Pane to allow
 for clients to override their type dynamically if need
 be.

## Syntax (C#)
```csharp
public class EditorInteraction
```